//local storage - способо хранения данных в браузере;
//данные хранятся "вечно"
//Можно использовать при хранении данных в корзине покупок; используется в YT: качество видео, громкость звука, тайминг по видео (если остановился на условно 20й минуте и при повторном запуске видео старт будет с 20й минуты), прочее.

//session storage - аналогичен local storage, не связаны друг с другом. Отличаются во времени жизни, объеме.
//Значение в session storage "живет" во время сессии пользователем, те то время, пока вкладка открыта.
//Работать с session storage аналогично local storage.